[
  {
    "Title": "Brawlhalla",
    "Tags": [
      "Fighting",
      "play for free",
      "platform",
      "2D",
      "indie games",
      "splitscreen"
    ],
    "Developer": "Blue Mammoth Games",
    "Publisher": "Xaviant",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "17",
    "Release_Date_Month": "October",
    "Release_Date_Year": "2017",
    "Game_Description": "Brawlhalla for PC, PS4 and PSV is a 2D classic fighting platformer which features a variety of single and multiplayer modes. The game is developed by an independent studio from America called Blue Mammoth Games known for a browser MMO game Dungeon Blitz. Brawlhalla is a free-to-play production, so you can get its standard version for free.MechanicsMechanics in Brawlhalla combine elements of classic 2D fighting games with platformer aspects. Gameplay comes down to fighting on different levels, which can be accessed exclusively by true legends, who aspire to prove their superiority. Each match is a test of players’ skill and the key to success is speed, strength, the mastery of attack combinations, and the skilful use of particular characters’ abilities.There are dozens of unique heroes modelled on classic characters from cartoons, comic books, and books – starting from medieval knights, through ruthless pirates, and ending with aliens. Each of them has a unique story and, most importantly, individual set of attacks and abilities. Additionally, the arenas are filled with a variety of weapons and gadgets, like swords, axes, hammers, blasters, cannons, mines, bombs, etc.Game modesPublished on PC, PS4 and PSV, Brawlhalla supports e-sport competitions as well as a purely friendly rivalry in one of many different single and multiplayer modes - you can play via the Internet and while squeezing a few local players onto the same screen. There are such modes as ranked multiplayer matches (1 v. 1, 2 v. 2), the free-for-all mode for 4 or 8 players, and their local counterparts along with the single player mode featuring competitions with bots.Technical aspectsFrom the technical point of view, Brawlhalla for PC, PS4 and PSV features an old-school, 2D graphic style. However, this does not mean that the visuals are poor – the title is displayed in high-definition and the amazingly-animated characters are full of details",
    "Expected_Rating": "7.5",
    "Current_Rating": "4.2"
  },
  {
    "Title": "Call of Duty: Black Ops III",
    "Tags": [
      "Action",
      "FPP",
      "science fiction",
      "FPS",
      "co-op",
      "shooters"
    ],
    "Developer": "Treyarch",
    "Publisher": "Activision Blizzard",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "06",
    "Release_Date_Month": "November",
    "Release_Date_Year": "2015",
    "Game_Description": "Call of Duty: Black Ops III for PC, PS4 and XONE is another installment in the popular shooter series. Set in the distant future, the game continues the story presented in Black Ops II, albeit this time we are dealing with an even grimmer vision of reality. Studio Treyarch took care of the production.\nStory\nThe story takes the player to the year 2065, 40 years after the drone attack organized by Raul Menendez in the previous part of the series. To prevent a similar situations from ever happening, the world has decided to create a special defense system. Unfortunately, nobody prepared for the other dangers that could lead humanity to the brink of chaos. Climate changes, shrinking resources, and an ideological conflict regarding genetic modifications and implants had divided the society and became a reason for increasingly bloodier wars.The situation slowly begins to spiral out of control, as some previously undisclosed military projects come to light, and we also need to keep in mind the increasing consciousness of machines, which complicates everything. Nevertheless, even the technologies available to the army are nothing compared to the so-called NDI, which is a gigantic mental network to which all members of the Black Ops special forces are connected. It allows the commandos to accomplish even the most difficult of tasks and provides them with a virtually superhuman coordination.\nAt the beginning of Call of Duty: Black Ops III, one of the teams is sent on a mission only to suddenly abandon it for no obvious reasons. A moments later, HQ witnesses the biggest leak of secret government data it has ever seen. Nobody knows what really happened – the player's task is to find the missing unit and get to the heart of the matter.\nGame modes\nThe campaign, in which we learn the rest of the story, is available in single player as well as in co-op mode for up to four players. An interesting option was also provided in the form of playing together on one screen. Unlike the previous parts of the series, the story campaign in Black Ops III has a more open map structure, and the missions begin in a special lobby. In the so-called bunker players can prepare for the assignment, select equipment, spend points on skills or read previously acquired notes.\nConsiderable changes have also been implemented in the multiplayer mode. Players were given the opportunity to take control of one of nine specialists, each with their own unique weapons and an additional special skill. Equally important is the additional option of running up walls and shooting underwater, thanks to which the maps, despite their small size, gain some additional depth. The gameplay is very dynamic, and the several extra moves that can be performed, thanks to the engines mounted on the soldier’s back, add to the game's fast and chaotic pace. The same applies to the cooperative zombie mode that returned to the series.\nTechnology\nIn terms of graphics, Call of Duty: Black Ops III for PC, PS4 and XONE looks very well, but it doesn’t differ too much in comparison to the previous installments in the series. Character animations are fluid, the cutscenes cinematic, and there is no shortage of spectacular scenes during both the campaign and multiplayer mode.",
    "Expected_Rating": "6.1",
    "Current_Rating": "5.2"
  },
  {
    "Title": "Conan Exiles",
    "Tags": [
      "Action",
      "FPP",
      "TPP",
      "fantasy",
      "books",
      "sandbox",
      "survival",
      "co-op",
      "crafting"
    ],
    "Developer": "FunCom",
    "Publisher": "Deep Silver / Koch Media",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "08",
    "Release_Date_Month": "May",
    "Release_Date_Year": "2018",
    "Game_Description": "Conan Exiles for PC, PS4 and XONE is an open-world action-RPG focusing on survival-related aspects and developed by FunCom. The team is known mainly for the well-received Age of Conan: Hyborian Adventures, but they also created such acclaimed titles as Anarchy Online or The Longest Journey.PlotConan Exiles is set in the fictional universe of Conan the Barbarian. The player assumes the role of an outcast who traverses dangerous wastelands. Although the plot is merely an excuse for the game's complex mechanics, the player gradually gets acquainted with the rich history of this world, which has remained hidden inside ancient ruins. Prehistoric civilizations left their marks here in the form of books, but also different inscriptions describing various events from the past.MechanicsConan Exiles for PC, PS4 and XONE features both first and third-person perspective. The player explores a diverse world of an open structure, thus the adventure leads through savannas, deserts, cavernous canyons, picturesque valleys, or the aforementioned ruins. Survival-related aspects constitute the backbone of the experience – although the player begins without any tools, they soon begin to craft their first, simplistic items and weapons. The game's complex crafting system allows the player to create useful items, as well as more and more deadly weapons, but apart from that, one is capable of constructing buildings, which can in turn become parts of large towns or fortresses. Through conquest and enslavement, the player gains different kinds of subordinates, such as warriors, archers or artists.The world of Conan Exiles is not a safe place. Different threats are made up here of unpredictable weather conditions (above all, sand storms), aggressive fauna, and human hostiles: various bandits and the titular exiles – those of the latter kind are worth taking alive, because their hearts can be sacrificed at the altars of gods. The in-game deities can decide to bestow a gift upon the player-controlled character (in the form of a unique ability), which oftentimes influences the course of a fight to a large extent. Combat is real-time here and the player makes use of melee weapons (spears, swords), ranged (bows) and the player-controlled exile's unique abilities. Both the physical and mental states of the protagonist are reflected in the actual gameplay – the player needs to be taking care about their character's health, but also their level of sanity, because exploring mysterious ruins with unknown, dark forces residing in-there, can drive the protagonist insane.Game modesConan Exiles for PC, PS4 and XONE can be played solo or among others. The player can choose a public server to play in, but they can also set up their own, on the basis of the pre-selected rules and options.Technical aspectsConan Exiles for PC, PS4 and XONE offers high-quality, three-dimensional visuals. What stands out here, is mainly the game's destructible environment created with care for detail, as well as complex character and creature models. The experience is complemented by the atmospheric soundtrack.",
    "Expected_Rating": "7.7",
    "Current_Rating": "4.3"
  },
  {
    "Title": "Demon's Souls",
    "Tags": [
      "RPG",
      "TPP",
      "fantasy",
      "reeditions/remasters/remakes",
      "co-op",
      "action RPG",
      "soulslike",
      "PlayStation exclusive titles"
    ],
    "Developer": "Bluepoint Games",
    "Publisher": "Sony Interactive Entertainment",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "12",
    "Release_Date_Month": "November",
    "Release_Date_Year": "2020",
    "Game_Description": "Demon's Souls Remake is a refreshed version of the classic action RPG from PlayStation 3. The prototype was developed by FromSoftware studio, and the new release is the responsibility of Bluepoint Games team, the authors of Shadow of the Colossus remake.",
    "Expected_Rating": "7.7",
    "Current_Rating": "4.3"
  },
  {
    "Title": "Destruction AllStars",
    "Tags": [
      "Action",
      "TPP",
      "vehicles",
      "network",
      "PlayStation exclusive titles"
    ],
    "Developer": "Lucid Games",
    "Publisher": "Lucid Games",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "02",
    "Release_Date_Month": "February",
    "Release_Date_Year": "2021",
    "Game_Description": "Destruction AllStars is a futuristic car game, which resembles the classic Destruction Derby as well as newer games such as Rocket League or OnRush.  The player takes on the role of a participant of extreme sports competitions, in which instead of racing with other drivers you fight with them in arenas and aim to destroy the vehicles they drive.  Game was developed by Lucid Games, a studio with such titles as Switchblade and Geometry Wars 3 in its portfolio. Game mechanicsIn Destruction AllStars we take on the role of one of sixteen stars of a brutal motor sport.  The available characters differ not only in appearance, but also in skills and unique vehicles.  The game also offers the possibility to modify the appearance of the heroes thanks to cosmetic items, which can be obtained as rewards or bought with special credits.We always start the action in Destruction AllStars moving on our own, but we can do much more by driving one of the dozens of available vehicles.  We can choose between standard machines, which appear in the arena, and the option to summon a special vehicle for a given hero.  Machines differ in performance, maneuverability and durability.  In the moment of destroying the driven car we can die or survive and set off to find another vehicle.  There is also an option to jump to another car and throw the driver out of it in order to get behind the wheel yourself - it's based on a simple mini-game. \nFights take place on large arenas, where we regularly clash with our rivals and try to complete objectives set by the match - these may include collecting points or finding objects.  Special abilities activated by characters and their vehicles can have a significant influence on the course of a match.  By activating a unique ability we can e.g. dazzle enemies, set other vehicles on fire, ram enemy machines with greater force or launch powerful area attacks.  The key to success is to activate abilities at the most appropriate moments in the game.MultiplayerIn Destruction AllStars we can play solo or with up to 15 other players (matchmaking by default).  Among the single player modes is primarily a story campaign/career.  Each chapter of the campaign focuses on one selected hero and requires completing challenges with different objectives.  Single player also allows you to practice controlling the available characters and join battles with bots on three difficulty levels. \nPowered By                         10 Sec      Patrol Boat - Cayo Perico Heist Setup / Prep Missions         NextStay    \n\n\n\nMatches in Destruction AllStars are divided into four main categories.  In Chaos mode, we fight for points, which are awarded primarily for destroying other vehicles and eliminating other players.  In Zone mode, the winner is the last player alive in the arena, which slowly collapses over the match.  Team Shrotnado mode involves collecting sprockets and delivering them to the tornado for the team to score points.  In Team Harvest mode, you also collect sprockets, though these are used to take and maintain control of banks in the arena.Technical aspectsDestruction AllStars features eye-catching 3D graphics thanks to the processing power of the PlayStation 5.  The game also takes advantage of a number of the console's distinctive  features, such as the DualSense pad's haptic functions (including   triggers that work with noticeable resistance) and Tempest 3D Audio.",
    "Expected_Rating": "7.7",
    "Current_Rating": "4.3"
  },
  {
    "Title": "Diablo III: Reaper of Souls - Ultimate Evil Edition",
    "Tags": [
      "RPG",
      "fantasy",
      "hack'and'slash",
      "Isometric view",
      "co-op",
      "action RPG",
      "splitscreen"
    ],
    "Developer": "Blizzard Entertainment",
    "Publisher": "Activision Blizzard",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "19",
    "Release_Date_Month": "August",
    "Release_Date_Year": "2014",
    "Game_Description": "Unleash hell in your living roomOver 15 million players have battled the demonic hordes of Diablo III.* Now, it’s your turn to join the crusade and take up arms against the enemies of the mortal realms. This Ultimate Evil Edition contains both Diablo III and the Reaper of Souls expansion set, together in one definitive volume. So stand ready. Something wicked this way comes.Lift the Demonic SiegeLay waste to hordes of evil throughout all five acts of the Diablo III storyline. Or explore the open world in Adventure Mode to hunt bounties on the elder evils that lurk throughout the mortal realms.Rise as a ChampionStand as one of humanity’s last defenders—crusader, wizard, monk, demon hunter, witch doctor, or barbarian — and level up with devastating powers and legendary equipment.Conquer a Dynamic BattlefieldLay waste to legions of evil throughout randomized, 3D environments. Face innumerable demonic villains, uncover quests in new locations, and claim an abundance of loot every time you play.Call Upon Your AlliesPlay solo or form a party of up to four heroes—either with local players together on the same screen or online with players.",
    "Expected_Rating": "6.0",
    "Current_Rating": "7.3"
  },
  {
    "Title": "Dying Light: The Following",
    "Tags": [
      "Action",
      "FPP",
      "survival horror",
      "zombie",
      "RPG elements",
      "Polish",
      "co-op",
      "crafting",
      "parkour"
    ],
    "Developer": "Techland",
    "Publisher": "Warner Bros. Interactive Entertainment",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "09",
    "Release_Date_Month": "February",
    "Release_Date_Year": "2016",
    "Game_Description": "The Following for PC, PS4 and XONE is an expansion pack to a popular action game Dying Light from 2015. The add-on was created by Techland studio, the authors of the base game,responsible for developing several other titles, including Dead Island and Call of Juarez. The expansion requires base game to play.\nStory\nThe Following is set after the events featured in Dying Light. The player once again takes on the role of Kyle Crane, who now travels to a new location - the suburbs of Harran. Your job is to help the hero infiltrate a camp of a mysterious cult. The members of this group are immune to zombie bites and are able to use the monsters to their own purposes. Given that, they may be the key to getting rid of the plague.\nGameplay\nGameplay in The Following for PC, PS4 and XONE is a little different from what you know from Dying Light. First of all, the developers wanted to give players more freedom, allowing them to choose which mission they want to do next. Another key element enabling them to do so is the new location, which is larger than all maps from the base game put together. As you play, you will often traverse open spaces, so the parkour may not always the best option, although there are many places where free running is still essential. Because of the vast new territory, dune buggies were introduced to the game. Although there is only this one type of vehicle available, the Driver Ranks progression system lets you improve your car as you earn experience (for completing special missions, driving over zombies, and so on). You can mount spikes on the car, upgrade its driving system, add larger fuel tank, etc. Furthermore, it is possible to repaint your machine or decorate it with decals.Apart from buggies, the developers have also implemented new weapons, including several firearms. You can now shoot zombies with a crossbow and an automatic pistol.\nGame modes\nDying Light: The Following  supports both single and multiplayer gameplay, the latter for up to four people playing together through campaign missions.\nTechnology\nThe Following for PC, PS4 and XONE expansion pack is based on the same technology (the sixth generation of Chrome Engine) as Dying Light. Therefore it retains the base game’s high quality graphics, featuring vast terrains, lots of detailed characters, and excellent special effects.",
    "Expected_Rating": "8.9",
    "Current_Rating": "7.9"
  },
  {
    "Title": "Enter the Gungeon",
    "Tags": [
      "Action",
      "science fiction",
      "roguelike",
      "2D",
      "dungeon-crawler",
      "indie games",
      "shoot 'em up",
      "shooters"
    ],
    "Developer": "Dodge Roll",
    "Publisher": "Devolver Digital",
    "Mode": "single player",
    "Release_Date_Day": "05",
    "Release_Date_Month": "April",
    "Release_Date_Year": "2016",
    "Game_Description": "Enter the Gungeon for PC, PS4 and etc. is a two-dimensional combination of a classic dungeon crawler and a shooter game, in which the players traverse a randomly generated dungeon. This is the debut of an American studio called Dodge Roll. The studio consists of five people, all of them experienced gamedevs, who decided to build a team, and this game is the outcome. Enter the Gungeon was created in cooperation with Devolver Digital - one of the most important publishers of the indie industry.PlotIn Enter the Gungeon for PC, PS4 and etc., the plot is simple and serves merely as a reason to begin the adventure. The player assumes the role of a vagabond who travels to a distant planet in search of a legendary weapon, which is supposedly capable of changing the past. Having reached his destination, the protagonist decides to infiltrate the titular Gungeon - a mysterious, ancient temple full of surprises and threats.MechanicsThe gameplay mechanics were inspired by many popular roguelikes and 16-bit console RPGs, but the game also draws inspirations from modern-day hits, such as Dark Souls. The player explores subsequent levels of the temple while encountering numerous enemies and bosses, as well as different shops and NPCs who offer help in the journey. All the elements of the titular Gungeon are procedurally generated.In Enter the Gungeon for PC, PS4 and etc., the combat system resembles popular shoot'em up games utilizing both analog sticks. It means that direction of fire doesn’t depend on the direction of movement and the other way around. The game features dozens of firearms, including different blasters, as well as more fantasy-driven and spectacular tools of destruction. Using the environment to one's advantage in combat is a strategically important aspect of the gameplay. For instance, the player can flip a table using it as a temporary cover, throw explosive barrels or drop chandeliers on the enemies. The protagonist is very sensitive to attacks, thus the player is forced to maneuver between volleys of bullets and explosions all the time. Using a dodge roll which makes the protagonist untouchable for a very short period of time plays an important part here as well.Technical aspectsThe game offers two-dimensional, retro visuals and an isometric camera. Enter the Gungeon was inspired by the aesthetics of console games which were in their prime in the first half of the nineties.",
    "Expected_Rating": "9.0",
    "Current_Rating": "7.9"
  },
  {
    "Title": "Hollow Knight",
    "Tags": [
      "Arcade",
      "platform",
      "2D",
      "metroidvania",
      "crowdfunding",
      "indie games"
    ],
    "Developer": "Team Cherry",
    "Publisher": "Team Cherry",
    "Mode": "single player",
    "Release_Date_Day": "25",
    "Release_Date_Month": "September",
    "Release_Date_Year": "2018",
    "Game_Description": "Hollow Knight for PC and SWITCH is a metroidvania game developed by the indie studio Team Cherry and crowdfunded on Kickstarter. Initially, the game was supposed to be released on many platforms, including Wii U, but ended up being available on PC and Nintendo Switch.The PlotThe game takes us to a fantasy city of Dirtmouth, underneath which a precipitous labirynth is located. That labirynth is said to be the remains of an ancient kingdom. It attracts all sorts of adventurers, but as soon as they enter it, they disappear without a trace. The game’s protagonist, the titular Hollow Knight, decides to face the challenge of the labirynth and, by finding its riches, gain glory. He also wants to find answers to the questions that haunt him.MechanicsGameplay in Hollow Knight for PC and SWITCH is presented from a side-scrolling perspective. We will have to explore vast, connected locations, collect more and more powerful equipment, progress our character, and fight with the encountered enemies. Given the character of the game’s genre, accessing many locations requires the usage of a specific item or solving a puzzle. Most of the time we travel by foot, but from time to time we will ride an insectoid mount.Many various enemies will stand in our way. Along with the regular opponents, we will have to fight with over thirty bosses. Defeating them will require us to learn their attack patterns and find their weaknesses. In combat, we will use melee weapons and magical powers. But enemies are not the only dangers that await us. The underground labirynth is filled with traps and chasms for which we have to look out if we do not want to end our adventures all too soon. But not everyone living below Dirtmouth is hostile towards our hero. We will meet many friendly NPCs who will be happy to share their knowledge with us or give us useful items, teach us new techniques, or upgrade our equipment.Technical AspectsHollow Knight for PC and SWITCH is based on the Unity technology. The game has warm, hand-drawn 2D visuals that in terms of rendition brings the classic animated movies to mind. Its evocative soundtrack was composed by Christopher Larkin.",
    "Expected_Rating": "2.8",
    "Current_Rating": "6.9"
  },
  {
    "Title": "Hunt: Showdown",
    "Tags": [
      "Action",
      "FPP",
      "Stealth",
      "FPS",
      "horror",
      "network",
      "co-op",
      "shooters",
      "19th century"
    ],
    "Developer": "Crytek",
    "Publisher": "Crytek",
    "Mode": "multiplayer",
    "Release_Date_Day": "18",
    "Release_Date_Month": "February",
    "Release_Date_Year": "2020",
    "Game_Description": "Hunt: Horrors of the Glided Age is a co-op action game based on the free-to-play business model with microtransactions from the American section of the Crytek company, made out of veterans of the Darksiders cycle.The action of the production takes place at the end of the XIXth century; in the studio’s vision of this period all of the legends and superstitions of that time are made real. Evil lurks around every corner and humanity is constantly threatened by monsters; the players, who step into the shoes of fearless, hardy hunters, decide to track down and eliminate the beast.\nHunt: Horrors of the Glided Age is largely meant to be played in the co-op mode for up to four players; the team’s composition is permanent and offers fixed characters with specific backstories and personalities. We can develop and equip each character with any gear we manage to get our hands on, allowing us to adjust the hero to suit our playstyle. The combat takes place on procedurally generated maps, which guarantees that each location will be in some ways unique; apart from the usual monsters, every once in a while, we have to bring down powerful bosses. We experience the action of Hunt from the third person perspective.\nThe production has been designed to force players into strict and close cooperation between each other, making the gameplay feel more like an actual hunt, with the hunters working together to bring down the powerful and intelligent beasts; killing even a single creature can prove to be quite the challenge, especially taking into consideration that our heroes carry limited amounts of ammunition and every bullet is worth its weight in gold.\nHunt: Horrors of the Gilded Age uses the CryEngine game engine, which grants the production high quality, detailed character models and huge open-world maps.",
    "Expected_Rating": "7.7",
    "Current_Rating": 8.5
  },
  {
    "Title": "Madden NFL 21",
    "Tags": [
      "Sports",
      "American football",
      "for 2 people",
      "splitscreen",
      "EA Play"
    ],
    "Developer": "EA Sports",
    "Publisher": "Electronic Arts Inc.",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "28",
    "Release_Date_Month": "August",
    "Release_Date_Year": "2020",
    "Game_Description": "Madden NFL 21 is the latest addition to the popular series of American football simulators, developed since 1997. As every year, the game features licensed teams and real, faithfully reproduced athletes, who we can lead to victory in subsequent matches. EA Sports specializing in sports games is responsible for developing this game.MechanicsMadden NFL 21 is an American football simulator. The game allows you to play matches with real, licensed teams from the American NFL. The developers put focus on the realism of the game - they made sure that the virtual struggle resembles as much as possible what we know from real sport.A novelty is the player control mechanics called Skill Stick, which allows you to perform a number of maneuvers both on the offensive (when you have the ball) and when you are defending yourself - it is about turns, jumps and slides, as well as passes that can be combined into complex combinations.\nIt is also worth noting that thanks to the refreshed Superstar X-Factor system (2.0), individual stars have their own characteristic moves and plays.Game modes\nIn Madden NFL 21 we can play both alone and with others. The game offers the possibility to play single matches as well as tournaments - both with a live opponent and AI-controlled athletes. In this game we can also find the Madden Ultimate Team module and the Face of the Franchise: Rise of Fame mode, which the creators describe as a documentary career mode.Technical aspectsMadden NFL 21 has very nice, three-dimensional graphics. Both stadiums and player models are characterized by a high level of realism and detail.",
    "Expected_Rating": "7.1",
    "Current_Rating": null
  },
  {
    "Title": "Maneater",
    "Tags": [
      "Action",
      "TPP",
      "sandbox",
      "under water",
      "indie games",
      "animals",
      "action RPG"
    ],
    "Developer": "Blindside Interactive",
    "Publisher": "Tripwire Interactive",
    "Mode": "single player",
    "Release_Date_Day": "22",
    "Release_Date_Month": "May",
    "Release_Date_Year": "2020",
    "Game_Description": "Maneater is an open-world action RPG developed by an independent studio Blindside Interactive; it's a team consisting of people who have previously created the warmly received Depth. The game was published by Tripwire Interactive.\nStory\nThe main character of Maneater is the eponymous man-eating shark, orphaned and left for dead in the waters of the Gulf Coast. Our primary task is to ensure that the protagonist manages not only to survive, but also to stand at the top of the local food chain. Only then will our protege be ready to take revenge on the people responsible for his mother's death.\nMechanics\nWhile playing Maneater we observe the action from TPP. Despite the original premise, the gameplay does not differ from the genre formula. As we play<, we explore the waters of the Gulf Coast, plundering sunken wrecks and nearby swamps, and searching the ocean floor for edible organisms.\nDue to the fact that in this production we play the role of a shark, the character progression system in the game is based on food. In the course of the game we devour not only swimmers relaxing in the waters of the Gulf Coast and divers exploring underwater secrets, but also other marine organisms; among them there are other predators fiercely defending themselves against landing in the stomach of the shark.Fortunately, our shark evolves over time; the enlargement of a selected part of his body results in the enhancement of certain features, and consequently - in the increase of the hero's combat potential. Thanks to this, his menu is constantly expanded, over time including organisms we could never devouring earlier.\nTechnical aspects\nManeater uses the Unreal Engine 4 technology; the locations we visit are full of details, as are the models of organisms we encounter. The game is characterized by a high level of brutality.",
    "Expected_Rating": "7.1",
    "Current_Rating": null
  },
  {
    "Title": "Monster Hunter: World - Iceborne",
    "Tags": [
      "RPG",
      "TPP",
      "fantasy",
      "co-op",
      "action RPG"
    ],
    "Developer": "Capcom",
    "Publisher": "Capcom",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "06",
    "Release_Date_Month": "September",
    "Release_Date_Year": "2019",
    "Game_Description": "Monster Hunter: World - Iceborne is a huge expansion to the 2018 action RPG Monster Hunter: World. Iceborne introduces a new, frosty land, full of different locations and new monsters. The expansion also introduces a number of changes to the combat system. The game was developed by Capcom (known from the Devil May Cry or Dragon's Dogma series).\nPlot\nThe expansion offers a completely new plot that takes place after the events of the original Monster Hunter: World. Velkhana, a new ice elder dragon, plays an important role in the story.\nMechanics\nThe basic gameplay mechanics of Iceborne are the same as in the main game. We get a vast open world to explore, and our goal is primarily to hunt various kinds of monsters. The expansion takes place in the snowy land of Hoarfrost Reach, where we find a number of previously unknown monsters and complete Master rank quests.Among new enemies is Velkhana, a powerful ice elder dragon who can control the temperature. The icy breath of the beast freezes everything, making it an incredibly dangerous adversary. We will also face Banbaro (a cross between a mighty snow buffalo and a ram), Beotodus (a wyvern that \"swims\" in the snow, using an unusual head shape to cut the ice) and Nargacuga (a flying wyvern with high agility).\nA new tool, The Clutch Claw, will help us in hunting. It is a hook mounted on a rope, which allows us to climb on the back of a creature we are fighting. We then gain access to new attacks, allowing, among other things, to control the movements of the beast (e.g. to accelerate and hit the wall or to drive the animal into a trap). We can also use this position to shoot directly at a weak point. In addition, we have access to several new moves - for example, we can shoot from a slingshot or use other items with weapons drawn. Many weapons have received new moves and combos.\nAn unfavorable climate also requires an appropriate approach - we often have to break through high snow and low temperatures can be a threat in themselves. To deal with them, we can, for example, harvest the right plants to prepare a warming potion.\nGame modes\nMonster Hunter: World - Iceborne does not introduce any new game modes. Just like in the basic version, we can play this production alone or with friends - the game features an online cooperation mode.\nTechnical aspects\nMonster Hunter: World - Iceborne expansion does not change the technical aspects of the game, but the new location has a different climate and uses several new effects, such as realistic snow forming around the shoes of the characters. The whole thing looks very credible.",
    "Expected_Rating": "5.4",
    "Current_Rating": "8.4"
  },
  {
    "Title": "NBA 2K20",
    "Tags": [
      "Sports",
      "Basketball",
      "for 2 people",
      "splitscreen"
    ],
    "Developer": "Visual Concepts",
    "Publisher": "2K Sports",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "06",
    "Release_Date_Month": "September",
    "Release_Date_Year": "2019",
    "Game_Description": "NBA 2K20 is the next installment of the hit series of sports games focusing on basketball. Just like all other installments, the title was developed by Visual Concepts.\nMechanics\nThe game is based on realism. NBA 2K20 offers powerful gameplay mechanics that faithfully reproduces both the player behavior and typical match play. The devs have obtained all the necessary licenses, including players, teams, and pitches. This applies not only to the eponymous NBA league but also, for the first time in the history of the series, to the women's WNBA. \nAdding female basketball players, teams and leagues is the biggest change, but not the only one. The devs have also improved the visuals, controls, and the ball's behavior on the pitch. AI has also been modernized.\nGame modes\nNBA 2K20 can be played solo or with others in local mode or over the Internet.\nThe MyCareer and MyTeam modes, which were known from previous installments of the game, are back. In the first one we create our own player, and then lead them through the subsequent stages of a professional basketball player's career. In MyTeam, we collect cards of athletes and exchange them with other players to create our own dream team.\nAn additional attraction is a story campaign for a manager and the NBA Blacktop mode, which focuses on street basketball.\nTechnical aspects\nNBA 2K20 boasts very attractive visuals. The devs meticulously depicted the appearance of the players, their costumes and pitches, and the additional charm of the visual setting is added by realistic animations.",
    "Expected_Rating": "5.4",
    "Current_Rating": "8.4"
  },
  {
    "Title": "Persona 5 Strikers",
    "Tags": [
      "Action",
      "TPP",
      "Japan",
      "action RPG",
      "jRPG",
      "slasher",
      "urban fantasy"
    ],
    "Developer": "Omega Force",
    "Publisher": "Atlus",
    "Mode": "single player",
    "Release_Date_Day": "23",
    "Release_Date_Month": "February",
    "Release_Date_Year": "2021",
    "Game_Description": "Persona 5 Scramble: The Phantom Strikers is a highly dynamic action RPG that is a spin-off of the popular jRPG Persona 5. The game was developed by Japanese studio Omega Force, best known for its Dynasty Warriors series, as well as a number of its games that use a similar gameplay model but are based on external licenses, such as Dragon Quest (Dragon Quest Heroes), The Legend of Zelda (Hyrule Warriors) and One Piece (One Piece: Pirate Warriors). Developers from P-Studio also helped with the development. Atlus is the publisher of this game.Plot\nPersona 5 Scramble: The Phantom Strikers is set six months after the events of Persona 5.  While a group of heroes, led by the original game's protagonist Joker, prepare for a holiday trip, a series of strange events occur in Japan that require the attention of phantom thieves. A strange girl named Sophia is also involved. The story begins in Tokyo, but during the game we also go to other places and cities - including Sapporo. MechanicsThe gameplay in Persona 5 Scramble: The Phantom Strikers is like a combination of what we know from Dynasty Warriors series with elements characteristic for Persona series.  The gameplay is mainly about exploring locations, completing tasks and fighting with new waves of enemies. The combat system is arcade and very dynamic, but at the same time has a tactical layer - the right sense of rhythm is important here; by striking at the right pace, we can stun large groups of enemies.A number of mechanics known from the main installments of the Persona series return - for example, we can develop our personas (these are peculiar \"ghosts\" accompanying the heroes and responsible for their unusual abilities) by spending special points, gain new ones (by picking up masks left over from some defeated enemies), and even combine them to create more powerful variants. The game also features skill cards, which allow you to give a specific ability to a particular persona. \nWe have the opportunity to control not only the Joker (who, like in Persona 5, has a unique ability to change personas during the fight), but also many other characters - mainly members of the  Phantom Thieves of Hearts team. The game allows to freely switch between characters during the game - we can choose any persona except  navigator.\nAs in Persona 5, strengthening the relationships between characters is also important.  By defeating enemies and reaching specific points in the story, we receive points called Band, which we can invest in stats.  Our heroes also learn during combat, with time unlocking special abilities - the  Master Arts. The longer we play a hero, the more options we get. Additionally, it is possible to buy equipment, which allows to increase effectiveness in battles. Game modes\n In Persona 5 Scramble: The Phantom Strikers we can only play alone.  The core of the game is a feature campaign.Technical aspects\nPersona 5 Scramble: The Phantom Strikers offers a good, 3D graphic design, which is similar in style to Persona 5. Both the characters and locations look like they have been taken out of an anime, and the animations during fights look very spectacular - the lighting effects accompanying the characters' special abilities deserve special attention.  The soundtrack is also similar - there is even an option to download tracks from the original game as DLC.",
    "Expected_Rating": "7.7",
    "Current_Rating": "6"
  },
  {
    "Title": "Rogue Company",
    "Tags": [
      "Action",
      "TPP",
      "play for free",
      "network",
      "TPS",
      "cross-platform",
      "shooters"
    ],
    "Developer": "Hi-Rez Studios",
    "Publisher": "Hi-Rez Studios",
    "Mode": "multiplayer",
    "Release_Date_Day": "30",
    "Release_Date_Month": "September",
    "Release_Date_Year": "2020",
    "Game_Description": "Rogue Company is an online shooter developed by Hi-Rez, the studio known for such games as Smite, Paladins: Champions of the Realm or Tribes: Ascend.\nPlot\nThe action of the game takes place in the near future. The eponymous Rogue Company is a syndicate of the best mercenaries from all over the world, sent to perform the most dangerous tasks.\nThe game is designed exclusively for multiplayer games, so the plot is mostly limited to bio of playable characters.\nMechanics\nRogue Company is focused on online PvP battles, i.e. against other players. The battles are team-based. Two groups compete against each other in matches and victory requires close cooperation with our comrades in arms.\nThe game boasts a large roster of characters and each of them has unique abilities and features.\nTechnical aspects\nThe game offers a cross-play option, allowing the owners of all the hardware platforms on which Rogue Company has appeared to have fun together.",
    "Expected_Rating": "3.5",
    "Current_Rating": null
  },
  {
    "Title": "Smite",
    "Tags": [
      "Action",
      "TPP",
      "fantasy",
      "MOBA",
      "play for free",
      "mythology",
      "network",
      "co-op",
      "Games as a service"
    ],
    "Developer": "Hi-Rez Studios",
    "Publisher": "Hi-Rez Studios",
    "Mode": "multiplayer",
    "Release_Date_Day": "31",
    "Release_Date_Month": "May",
    "Release_Date_Year": "2016",
    "Game_Description": "Smite is a production that focuses on network skirmishes between the players. The whole is based on the model well-known from Defense of the Ancients mod for Warcraft III with three key differences. Firstly, battles are shown from a third person perspective. Secondly, controls are inspired by typical action games/TPP. Finally, the gameplay is arcade, because is is based on the so-called skillshots. This basically means that any attack or spell needs to be carefully aimed if you do not want to miss. The game was developed by a team at Hi-Rez Studios which has already released such titles as Global Agenda and Tribes: Ascend.The players assume the role of deities from different mythologies. Each of the available characters has its own characteristics and unique powers. Our task is to reach the enemy base and kill the mighty Minotaur located there. There are computer-controlled allied units implemented moving along the designated lines in order to help us. As you progress in the game, gold and experience points gained are used to acquire new weapons and powers. What distinguishes this game from the countless DotA clones is the control system. Most of the competition utilizes a strategy game style of controls such as issuing commands with the mouse. Smite, on the other hand, is played just like arcade games. The camera is placed behind the back of the protagonist and combat effectiveness of a deity depends both on our reflexes and our accuracy, not just statistics.The game is based on the free model with voluntary micropayments. The game was built using the Unreal Engine 3.0 technology, which provides graphics full of details, presenting a significantly higher graphic level than typical DotA clones.",
    "Expected_Rating": "9.0",
    "Current_Rating": "4.4"
  },
  {
    "Title": "Tom Clancy's Rainbow Six: Siege",
    "Tags": [
      "Action",
      "FPP",
      "terrorism",
      "tactical",
      "FPS",
      "network",
      "co-op",
      "shooters"
    ],
    "Developer": "Ubisoft",
    "Publisher": "Ubisoft",
    "Mode": "multiplayer",
    "Release_Date_Day": "01",
    "Release_Date_Month": "December",
    "Release_Date_Year": "2015",
    "Game_Description": "In 2011 Ubisoft announced Tom Clancy's Rainbow 6: Patriots. It was supposed to be another installment in the famous series of tactical shooters, this time focusing on combat with a terrorist organization called True Patriots. Since then, years had passed, and the project slowly faded away. Finally, the publisher decided to unveil Rainbow Six: Siege, tailor-made for multiplayer gameplay. This title replaced Patriots, which failed to meet the expectations of the French company. This PC, PS4 and XONE game features skirmishes of antiterrorist special forces with criminals. The game was built on AnvilNext technology, the engine used in several other Ubisoft titles, including the Assassin's Creed series, For Honor, and Tom Clancy's Ghost Recon Wildlands.Before you start playing Rainbow Six: Siege you choose your soldier’s specialization. Each time you play you can decide whether you want to raise barricades as Castle, remove obstacles as Thermite, cripple enemy communication as Mute, break open doors as Ash, wield a huge sledgehammer as Sledge, or poison enemies as Smoke. Of course, these are not all character classes available, and it is important to compose a team whose members complement each other in combat.\nCombat takes place in small, relatively narrow locations, where you have to quickly clear one room after another until you get rid of terrorists and free any hostages. In order to do this, you often have to blow up a wall, plant explosives on the floor to attack enemies from above, and so on. On the other hand, when playing as terrorists you must barricade doors and fortify your positions, so as not to get caught off guard by the law enforcement units. Either way, in order to defeat a smart team of players you need constant communication, teamwork, and proper tactics.\nGameplay is fast-paced and exciting, yet tactical, mostly thanks to destructible environment. The game engine lets you destroy not only doors, but also barricades and walls. As a result, battlefields are dynamically changing in the course of a skirmish, which often requires adjusting your well-planned tactics on the spot.\nIn terms of graphics quality Rainbow Six: Siege for PC, PS4 and XONE doesn't set new standards in video gaming, but it is surely satisfying. The aforementioned damage system not only enriches the gameplay, but also spices up the visuals, giving them a specific character.",
    "Expected_Rating": "7.9",
    "Current_Rating": "5.8"
  },
  {
    "Title": "Warface",
    "Tags": [
      "Action",
      "FPP",
      "play for free",
      "modern conflicts",
      "FPS",
      "network",
      "co-op",
      "MMO",
      "shooters",
      "Battle Royale"
    ],
    "Developer": "Crytek / Blackwood Games",
    "Publisher": "Crytek",
    "Mode": "single / multiplayer",
    "Release_Date_Day": "18",
    "Release_Date_Month": "September",
    "Release_Date_Year": "2018",
    "Game_Description": "The PC and X360 release of Warface is a military shooter set in the relatively near future offering only multiplayer game modes. The game is based on the free-to-play model and features a microtransaction system. Warface was developed by Crytek, also known for game series like Far Cry and Crysis.The game had been available on Xbox 360 since 2014, however on 1 February 2015 the developer abandoned this version of the game – currently it’s available only on PC / Windows.MechanicsUnlike many multiplayer shooters, Warface offers not only PvP but also PvE modes, in which a team of players can fight the AI-controlled opponents. The PvP modes feature a set of relatively regular elements: solo and team deathmatches, planting a bomb, or storm, in which players have to take control over a number of checkpoints located on the map. Cooperation is an interesting aspect of the game delivering a number of missions of increasing difficulty. In most of them, our squad has to get through a city occupied by enemy soldiers, including powerful minibosses (e.g. Heavy Gunner), to eventually meet one of the bosses (e.g. enormous mech). Warface also features Special Operations – a mode based on fighting off waves of enemy troops. Initially, there was only one mission of this type; however, as the time passed developers did not fail to consequently add some new content (The Great White, Cyber Horde, Marathon, Earth Shaker, and Anubis).\nLike in other popular online shooters, before playing, one has to select their character’s class. Each class is defined by a set of unique functions and abilities on the battlefield – the game offers four, quite typical, soldier classes: the Medic, who can heal his allies, the Engineer, who specializes in repairing armor, the Sniper – the best choice for a long range takedowns, and the Rifleman, who always carries some spare ammo with him. Using these unique skills is crucial in all game modes, especially when playing the co-op, where players have to work together.\nThe PC and X360 release of Warface includes some proprietary ideas aiming at gameplay diversification. The game is based on CryEngine 3 and features mechanics similar to what one can find in other Crytek’s games. Because of that, soldiers display extreme mobility – they can jump over ledges, climb walls, and even perform slide tackles. Moreover, players can use the in-battle weapons customization menu, along with other additions.Technical aspectsWarface features high-quality visuals, based on Crytek’s proprietary graphics engine – CryEngine 3. This allowed the developers to implement detailed textures and character models, as well as realistic soldier animations.Misc.Since its premiere, Warface has undergone some changes. Most importantly, the game is no longer available via web browsers – it can be downloaded from Steam, or the official website (which uses the GFACE application). Moreover, the microtransaction system has been subjected to changes too – players buy new weapons using Warface dollars, a currency earned during the game. Credits (premium currency), on the other hand, can be spent on cosmetic elements, like character and weapon skins, as well as at the auction house. The latter one is a yet another novelty implemented by Crytek – this option allows players to sell unnecessary items they acquire randomly.\nAnother thing worth mentioning is the introduction of the ranked matches and 2 anti-cheat systems – FairFight and Easy Anti Cheat, which effectively eliminated the cheater problem, at least to some extent.",
    "Expected_Rating": "6.6",
    "Current_Rating": "6.2"
  },
  {
    "Title": "We Were Here",
    "Tags": [
      "Puzzle",
      "FPP",
      "adventure elements",
      "indie games",
      "co-op"
    ],
    "Developer": "Total Mayhem Games",
    "Publisher": "Total Mayhem Games",
    "Mode": "multiplayer",
    "Release_Date_Day": "09",
    "Release_Date_Month": "February",
    "Release_Date_Year": "2021",
    "Game_Description": "We Were Here is an unusual puzzle game for two players. The title was developed by an independent studio Total Mayhem Games. The title was released on PC as a free-to-play title.MechanicsIn We Were Here for PC the action is presented from the first-person perspective. The game takes place in a mysterious, abandoned castle located in a cold wasteland. The players take control of two characters. The first player assumes the role of a prisoner locked in a small part of the fortress while the second player has access to a much larger part of the area. The main objective of the game is to make both characters meet each other in person.What makes this task harder is the fact that, similarly to Myst series, the game contains many logic and environmental riddles of various difficulty. Like in popular escape rooms, cooperation is needed to succeed. However, the only way the players can communicate with each other is through a radio. In addition to that, the players must face harsh conditions in the castle – the protagonists can, for example, freeze to death.Game modesWe Were Here for PC offers only cooperation mode. It is possible to play with the other player only through the Internet – the developers decided that a split screen mode wouldn’t work well here.Technical aspectsWe Were Here for PC features middle-of-the-road graphics. It is worth mentioning that the game supports virtual reality goggles. However, they aren’t mandatory to play the game.",
    "Expected_Rating": "6.6",
    "Current_Rating": "6.2"
  },
  {
    "Title": "World of Tanks: Console",
    "Tags": [
      "Simulation",
      "tanks",
      "play for free",
      "co-op",
      "MMO",
      "shooters"
    ],
    "Developer": "Wargaming",
    "Publisher": "Wargaming",
    "Mode": "massive online multiplayer",
    "Release_Date_Day": "19",
    "Release_Date_Month": "January",
    "Release_Date_Year": "2016",
    "Game_Description": "World of Tanks is a free-to-play MMO shooter in which the players take control of the eponymous armored tools of war. The game was developed by the Chicago division of Wargaming.net, the creators of Order of War and the Massive Assault series. The initial version of the game was released in the spring of 2011 for PC, but since the production proved to be incredibly successful, it was eventually converted to 7th- and 8th-generation platforms as well. Later on, World of Tanks Blitz, a somewhat simplified mobile edition of the title, and World of Tanks Generals, a strategy card game, were released.\nGameplay\nThe essence of World of Tanks for PC, PS4 and etc. is competitive multiplayer gameplay in short mini-campaigns and tournaments as well as single battles fought in one of several game modes. The action is shown from third-person perspective, featuring simulation complemented with action, strategy, and RPG elements. The production offers more than 300 different tanks and armored vehicles (roughly 150 were present in the initial release) from various historical periods to choose from; from the World War I to Cold War era. The vehicles come from different countries (the USA, the Soviet Union, Germany, France, Great Britain, Japan, and China) and are divided into five main classes: light, medium, and heavy tanks, tank destroyers, and self-propelled guns. Moreover, each of those is assigned to one of ten tiers that determines their advancement level.Starting out, we are given tier 1 vehicles only. We unlock access to the remaining ones, divided further into country-specific technology trees, as we progress and gather experience. Furthermore, we may buy a number of enhancements, such as engines, turrets, chassis, guns or radio systems, for the credits we earn playing. What is interesting, all of them have their historical justification — either their prototypes existed or they were actually introduced into service at some point. We might also purchase a myriad of useful gadgets, including camouflage, modern targeting systems, repair kits or first aid kits, with which we can treat wounded crew members. It is also worth of mention that the personnel also gains experience, which translates into improved performance on the battlefield.\nGame modes\nThe production of Wargaming.net offers an incredibly wide range of game modes, which is constantly broadened with subsequent updates. Among the most important ones we can find the random battle, squad battle, clan war, company, assault or the stronghold mode. Two 15-member teams (PlayStation 4 has this number increased to 30), which can be additionally divided into 2- or 3-member platoons, may participate in a single battle. As befits a proper MMO title, World of Tanks does not lack the possibility of joining or creating a clan (with a maximum of 100 members) and competing with other clans for control over areas on the world map.\nTechnology\nWorld of Tanks for PC, PS4 and etc. is powered by the BigWorld Technology engine modified for the purposes of the game. Thanks to the high quality visuals and simulation-focused gameplay, we may feel like a real tank commander. The destruction model is especially noteworthy. It takes into account such factors as the shell’s hit angle, armor thickness and the like, and the calculations of the shell's chance to penetrate individual modules and damage taken by the crew is depicted with percentages.\nAdditional information\nWorld of Tanks was awarded a number of industry awards, including the most innovative game at E3 2010 as well as the Golden Joystick Award for the best MMO of 2012. Moreover, the game was recorded in the Guinness World Records for the largest amount of players logged in at the same time on a single MMO game server. On January 21st 2013, 190.541 players were playing simultaneously on a Russian server.",
    "Expected_Rating": "8.7",
    "Current_Rating": "3.3"
  }
]